<?php

return [
<<< 'EOF'
下記のテーブルcustomer_dataから、全てのデータを抽出
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+
<写経内容>
select * from  customer_data;
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、idが1のデータのみを抽出
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+
<写経内容>
select * from  customer_data where id ="1";
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、nameのカラムのみを全て抽出
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+

<写経内容>
select name from customer_data;
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、nameとmailのカラムのみを全て抽出
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+
<写経内容>
select name,mail from customer_data;
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、idが3以上のnameとmailのカラムのみを全て抽出
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+

<写経内容>
select name,mail from customer_data where id >=3;
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、mailに『@gmail.com』が含まれるデータを全て抽出。
+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+

<写経内容>
select * from customer_data where mail like "%@gmail.com%";
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataのid=1の
telを03-0000-0000に変更。

+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-1511-3333  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+

<写経内容>
update customer_data set tel ="03-0000-0000" where id=1;
EOF
,
<<< 'EOF'
下記のテーブルcustomer_dataから、
id=2のデータを削除。

+------+----------+--------------------+---------------+
| id   | name     | mail               | tel           |
+------+----------+--------------------+---------------+
|    1 | 山田太郎 | y.taro@gmail.com   | 03-0000-0000  |
|    2 | 佐藤花子 | h.sato@yahoo.co.jp | 090-7724-8842 |
|    3 | 田中次郎 | tziro@gmail.com    | 080-8824-4445 |
|    4 | 鈴木三郎 | sabuszk@gmail.com  | 090-2224-8424 |
+------+----------+--------------------+---------------+

<写経内容>
delete from customer_data where id=2;
EOF
];
