<?php

return [
    [ // vol1
        "output" => "",
        "model" =>  explode("\n", <<< 'EOF'
下記のテーブルfruit_stockから、idが何件あるかを集計。

+------+--------------+--------+-------+--------------+
| id   | fruit        | number | price | madein       |
+------+--------------+--------+-------+--------------+
|    1 | りんご       | 33     | 100   | 日本         |
|    2 | オレンジ     | 40     | 120   | 日本         |
|    3 | イチゴ       | 10     | 250   | 日本         |
|    4 | ぶどう       | 25     | 240   | アメリカ     |
|    5 | ナシ         | 23     | 150   | 日本         |
|    6 | パイナップル | 15     | 230   | フィリピン   |
+------+--------------+--------+-------+--------------+

EOF
)
,
        "inputs" => [
            [
                'title' => 'エディタ',
                'ext' => 'sql',
                'name' => 'index',
                "contents" => explode("\n", <<< 'EOF'
EOF
)
],
        ]
    ],
    [ // vol2
        "output" => "",
        "model" =>  explode("\n", <<< 'EOF'
下記のテーブルfruit_stockから、フィリピン産のfruitが何件あるかを集計。

+------+--------------+--------+-------+--------------+
| id   | fruit        | number | price | madein       |
+------+--------------+--------+-------+--------------+
|    1 | りんご       | 33     | 100   | 日本         |
|    2 | オレンジ     | 40     | 120   | 日本         |
|    3 | イチゴ       | 10     | 250   | 日本         |
|    4 | ぶどう       | 25     | 240   | アメリカ     |
|    5 | ナシ         | 23     | 150   | 日本         |
|    6 | パイナップル | 15     | 230   | フィリピン   |
+------+--------------+--------+-------+--------------+

EOF
)
,
        "inputs" => [
            [
                'title' => 'エディタ',
                'ext' => 'sql',
                'name' => 'index',
                "contents" => explode("\n", <<< 'EOF'
EOF
)
],
        ]
    ],
    [ // vol3
        "output" => "",
        "model" =>  explode("\n", <<< 'EOF'
下記のテーブルfruit_stockから、日本産のnumberの合計がいくつかを集計。

+------+--------------+--------+-------+--------------+
| id   | fruit        | number | price | madein       |
+------+--------------+--------+-------+--------------+
|    1 | りんご       | 33     | 100   | 日本         |
|    2 | オレンジ     | 40     | 120   | 日本         |
|    3 | イチゴ       | 10     | 250   | 日本         |
|    4 | ぶどう       | 25     | 240   | アメリカ     |
|    5 | ナシ         | 23     | 150   | 日本         |
|    6 | パイナップル | 15     | 230   | フィリピン   |
+------+--------------+--------+-------+--------------+

EOF
)
,
        "inputs" => [
            [
                'title' => 'エディタ',
                'ext' => 'sql',
                'name' => 'index',
                "contents" => explode("\n", <<< 'EOF'
EOF
)
],
        ]
    ],
    [ // vol4
        "output" => "",
        "model" =>  explode("\n", <<< 'EOF'
下記のテーブルfruit_stockから、一番安いpriceを抽出する。

+------+--------------+--------+-------+--------------+
| id   | fruit        | number | price | madein       |
+------+--------------+--------+-------+--------------+
|    1 | りんご       | 33     | 100   | 日本         |
|    2 | オレンジ     | 40     | 120   | 日本         |
|    3 | イチゴ       | 10     | 250   | 日本         |
|    4 | ぶどう       | 25     | 240   | アメリカ     |
|    5 | ナシ         | 23     | 150   | 日本         |
|    6 | パイナップル | 15     | 230   | フィリピン   |
+------+--------------+--------+-------+--------------+

EOF
)
,
        "inputs" => [
            [
                'title' => 'エディタ',
                'ext' => 'sql',
                'name' => 'index',
                "contents" => explode("\n", <<< 'EOF'
EOF
)
],
        ]
    ],
    [ // vol5
        "output" => "",
        "model" =>  explode("\n", <<< 'EOF'
下記のテーブルfruit_stockから、priceの平均値を出す。

+------+--------------+--------+-------+--------------+
| id   | fruit        | number | price | madein       |
+------+--------------+--------+-------+--------------+
|    1 | りんご       | 33     | 100   | 日本         |
|    2 | オレンジ     | 40     | 120   | 日本         |
|    3 | イチゴ       | 10     | 250   | 日本         |
|    4 | ぶどう       | 25     | 240   | アメリカ     |
|    5 | ナシ         | 23     | 150   | 日本         |
|    6 | パイナップル | 15     | 230   | フィリピン   |
+------+--------------+--------+-------+--------------+

EOF
)
,
        "inputs" => [
            [
                'title' => 'エディタ',
                'ext' => 'sql',
                'name' => 'index',
                "contents" => explode("\n", <<< 'EOF'
EOF
)
],
        ]
    ]
];
